{
  "title": "Dead Bastard Society – To-Do Masterfile (With Rationale)",
  "version": "June 2025",
  "site": "deadbastardsociety.com",
  "purpose": "Document what must be built or finished next in the DBS Universe and why it's essential to the vision.",
  "tasks": [
    {
      "task": "🪪 Complete Scroll Unlock System",
      "why": "Scrolls are core to DBS prophecy. Unlocking by rank/archetype increases immersion, rewards dedication, and powers lore-based ranking."
    },
    {
      "task": "🎖️ Finalize Badge + Rank Tracker",
      "why": "The badge system is the glue of the Brotherhood. Connecting badge triggers (via skits, quests, uploads) to rank ensures continuity and gamifies the site."
    },
    {
      "task": "🧪 Upgrade Mood Engine for Lucidus",
      "why": "Lucidus should behave like a real entity. A mood system with variable memory recall adds depth and makes him feel alive and unpredictable."
    },
    {
      "task": "📍 Deploy Geo Memory + Town Claiming",
      "why": "User hometowns drive narrative expansion. Each new user from a location expands the map, unlocks lore, and generates region-specific strain names."
    },
    {
      "task": "📜 Build Member Mirror (Profile Reflection Page)",
      "why": "A personal page that reflects a user’s rank, tags, scrolls, and Latin name will give every member a reason to explore and keep returning."
    },
    {
      "task": "🔓 Voice Passphrase Scroll Access",
      "why": "Using voice to unlock prophecy scrolls adds magic, exclusivity, and keeps guests from randomly accessing sacred lore."
    },
    {
      "task": "🧠 Launch User Memory Editor (Admin UI)",
      "why": "Manual correction and expansion of user files allows custom adjustments. Needed for upgrades, debugging, and narrative expansion."
    },
    {
      "task": "📡 Add External Search Terminal (GPT + Web)",
      "why": "Members should be able to search world lore and real events through Lucidus, connecting fiction and reality."
    },
    {
      "task": "📦 Publish Full Plugin + Theme ZIP for Public Testing",
      "why": "A clean, installable, test-ready package helps onboard collaborators and provides restore capability in case of failure."
    },
    {
      "task": "🌍 Visualize County Map (DBS-style Morph Map)",
      "why": "The cartoon county map lets users see DBS expand in real time. Core to showing living growth and territorial humor."
    },
    {
      "task": "🎙️ Integrate ElevenLabs voice switching by Archetype",
      "why": "Each archetype should have a signature voice. This adds immersion, especially when Lucidus replies in Dub, Randall, or Nasty P tones."
    }
  ],
  "meta": {
    "status": "Tasks reviewed and prioritized by importance to immersion, gamification, and lore structure.",
    "generated": "2025-06-12T20:04:59.028407"
  }
}